---
kind: method
id: M:Autodesk.Revit.DB.DeleteWorksetSettings.#ctor
source: html/b6ac74c3-4ca6-27e7-c61b-0c496000fc18.htm
---
# Autodesk.Revit.DB.DeleteWorksetSettings.#ctor Method

Constructs a DeleteWorksetSettings object with DeleteWorksetOption::DeleteAllElements option.

## Syntax (C#)
```csharp
public DeleteWorksetSettings()
```